app/controllers/activities_controller.rb

INSERT INTO "activities" ("title", "description", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Et cillum obcaecati "], ["description", "Voluptatem odit et "], ["date", "2017-03-05"], ["created_at", "2019-11-20 16:11:03.249880"], ["updated_at", "2019-11-20 16:11:03.249880"]]
---
  def create
    @activity = Activity.new(activity_params)
    # Melhorar condição para salvar quando terminar o show do usuário
    if @activity.save

SELECT "activities".* FROM "activities"
---
  def index
    @activities =  Activity.all

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @activity = Activity.find(params[:id])

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @activity = Activity.find(params[:id])

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "activities" SET "title" = $1, "description" = $2, "date" = $3, "updated_at" = $4 WHERE "activities"."id" = $5  [["title", "Quasi jgirejioghiro molest"], ["description", "girjgirjgij omnis at"], ["date", "2024-10-31"], ["updated_at", "2019-11-20 20:40:57.568808"], ["id", 5]]
---
  def update
    @activity = Activity.find(params[:id])

    if @activity.update(activity_params)

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 3]]
---
  def destroy
    @activity = Activity.find(params[:id])
    if @activity.destroy

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def toggle_interest
    @activity = Activity.find(params[:id])