app/controllers/home_controller.rb

    def index
        @activities = Activitie.all
---
SELECT "activities".* FROM "activities"